app/views/posts/_profile.html.erb

SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
---
  <div>
    <span class="text-white">Posts:<%= current_user.posts.count%></span>