app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("post", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["post", "Hello. Welcome to ClubHouse - a new app to chat with friends!"], ["created_at", "2021-06-30 05:44:09.435913"], ["updated_at", "2021-06-30 05:44:09.435913"], ["user_id", 1]]